---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateOpenMiddleStringers
source: html/5bab696d-a8bc-1bf4-67f1-ca6b9b064812.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateOpenMiddleStringers Property

Can't cut open/middle stringers geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateOpenMiddleStringers { get; }
```